package ru.netology

import java.lang.reflect.Array

data class Post (
    val id:Int,//идентификатор записи.
    val owher_id: Int,//идентификатор владельца стены, на которой размещена запись
    val from_id:Int,//идентификатор автора записи
    val created_by:Int,//идентификатор администратора, который опубликовал запись
    val date:Int,//время публикации записи в формате unixtime
    val text: String,//текст записи.
    val reply_Owner_id:Int,//идентификатор владельца записи, в ответ на которую была оставлена текущая.
    val reply_post_id:Int,//дентификатор записи, в ответ на которую была оставлена текущая.
    val friends_only:Boolean,//, если запись была создана с опцией «Только для друзей».
    val comments:Comment,//информация о комментариях к записи,
    val copyright :Copyright,//источник материала, объект с полями:
    val likes:Like,//информация о лайках к записи, объект с полями:
    val reposts: Int,//информация о репостах записи («Рассказать друзьям»), объект с полями:
    val views:View,//информация о просмотрах записи. Объект с единственным полем:
    val post_type:String,//тип записи, может принимать следующие значения: post, copy, reply, postpone, suggest.
    val post_source:Post_source,//информация о способе размещения записи. Описание объекта находится на отдельной странице.
    val attachments:Array,//медиавложения записи (фотографии, ссылки и т.п.). Описание массива attachments находится на отдельной странице.
    val geo:Geo,//информация о местоположении , содержит поля:
    val signer_id:Int,//идентификатор автора, если запись была опубликована от имени сообщества и подписана пользователем;
    val copy_history:Array,//массив, содержащий историю репостов для записи. Возвращается только в том случае, если запись является репостом. Каждый из объектов массива, в свою очередь, является объектом-записью стандартного формата.
    val can_pin:Boolean,//информация о том, может ли текущий пользователь закрепить запись
    val can_delete:Boolean,//информация о том, может ли текущий пользователь удалить запись
    val can_edit:Boolean,//информация о том, может ли текущий пользователь редактировать
    val is_pinned:Boolean,//информация о том, что запись закреплена.
    val marked_as_ads:Boolean,//информация о том, содержит ли запись отметку "реклама
    val is_favorite:Boolean,//true, если объект добавлен в закладки у текущего пользователя.
    val donut:Donut,//информация о записи VK Donut:
    val postponed_id:Int //	идентификатор отложенной записи. Это поле возвращается тогда, когда запись стояла на таймере.




)
    {

    }